package Lesson3_Homework;

import java.util.Arrays;

//Задача 1
//Создайте массив из всех чётных чисел от 2 до 20 и выведите элементы массива на экран сначала в строку,
//отделяя один элемент от другого пробелом, а затем в столбик (отделяя один элемент от другого началом новой строки).
//Перед созданием массива подумайте, какого он будет размера. 2 4 6 … 18 20 2 4 6 … 20

public class Task1 {
    public static void main(String[] args) {
        int[] tiger = new int[10];
        for (int i=0; i<10; i++) {
            tiger[i]=(i+1)*2;
            System.out.println(tiger[i]);
        }
        System.out.println(Arrays.toString(tiger));
//В задании нужно сначала вывести массив в строку, но мне не хотелось создавать отдельный цикл для вывода по одному элементу.
// Если это необходимо сделать точно так - легко доработаю класс
    }
}
