package lesson6Homework.task2;

//Задание 2
//
//        Реализовать простое средство для считывания и записи информации из конфигурационных
//        файлов (данные в файле хранятся в формате ключ:значение ).
//
//        Реализацию механизмов чтения/записи файла опустим!!!, чтобы сосредоточить внимание на структуре кода.
//
//        За работу с каждым типом файла будет отвечать отдельный класс (например, XmlHandler за файлы .xml,
//        TxtHandler за файлы .txt и тд). Но с каким именно файлом придется работать Вы изначально не знаете

public class Main {
}
